app/controllers/tasks_controller.rb

  def create
    @task = Task.new(params[:task].merge(:cookiecode => user_cookie_code))
    @task.save
---
INSERT INTO "tasks" ("name", "slug", "updated_at", "webcode", "cookiecode", "complete", "created_at") VALUES('my task', 'my-task', '2009-06-06 20:43:24', 'secret2', NULL, 'f', '2009-06-06 20:43:24')

  def update
    @task = Task.lookup(params[:id])
    @task.update_attributes(
      params[:task].merge(:update_cookiecode => cookies['taskdone_code'])
    )
---
UPDATE "tasks" SET "complete" = 't', "updated_at" = '2009-06-06 20:48:30' WHERE "id" = 1